# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
#-----------stem one 0-4层-------------#
  ### visible image input ###
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4
  ### infrared image input ###
  # [from, repeats, module, args]
  - [-2, 1, Conv, [ 64, 3, 2 ] ]  # 5-P1/2 定义-2来自输入
  - [-1, 1, Conv, [ 128, 3, 2 ] ]  # 6-P2/4
  - [-1, 3, C2f, [ 128, True ] ]  # 7
  - [-1, 1, Conv, [ 256, 3, 2 ] ]  # 8-P3/8
  - [-1, 6, C2f, [256, True]]  # 9
#-----------stem one-------------#
#-----------fusion bloak one -------------#
  - [[ 4,9 ], 1, DFMSDA, [ 256,4 ] ],   # 10-P3/8
  - [[ 4,10 ], 1, Add2, [ 256,0 ] ],    # 11-P3/8 stream one x+trans[0]
  - [[ 9,10 ], 1, Add2, [ 256,1 ] ],    # 12-P3/8 stream two x+trans[1]
#-----------fusion bloak one -------------#
#-----------stem two 5-6层-------------#
  ### visible image input ###
  # [from, repeats, module, args]
  - [4, 1, Conv, [512, 3, 2]]  # 13-P4/16
  - [-1, 6, C2f, [512, True]]  # 14
  ### infrared image input ###
  # [from, repeats, module, args]
  - [9, 1, Conv, [512, 3, 2]]  # 15-P4/16
  - [-1, 6, C2f, [512, True]]  # 16
#-----------stem two-------------#
#-----------fusion bloak two -------------#
  - [[14,16], 1, DFMSDA, [512,8]],   # 17-P3/8
  - [[14,17], 1, Add2, [512,0]],    # 18-P3/8 stream one x+trans[0]
  - [[16,17], 1, Add2, [512,1]],    # 19-P3/8 stream two x+trans[1]
#-----------fusion bloak two -------------#
#-----------stem three-------------#
  ### visible image input ###
  # [from, repeats, module, args]
  - [12, 1, Conv, [1024, 3, 2]]  # 20-P5/32
  - [-1, 3, C2f, [1024, True]]  # 21
  - [-1, 1, SPPF, [1024, 5]]  # 22
  ### infrared image input ###
  # [from, repeats, module, args]
  - [ 14, 1, Conv, [ 1024, 3, 2 ] ]  # 23-P5/32
  - [ -1, 3, C2f, [ 1024, True ] ]  # 24
  - [ -1, 1, SPPF, [ 1024, 5 ] ]  # 25
#-----------stem three-------------#
#-----------fusion bloak three -------------#
  - [[22,25], 1, DFMSDA, [1024,16]],    # 26-P5/32
  - [[22,26], 1, Add2, [1024,0]],    # 27-P5/32 stream one x+trans[0]
  - [[25,26], 1, Add2, [1024,1]],    # 28-P5/32 stream two x+trans[1]
#-----------fusion bloak three -------------#
  ######### Add Block #############
  - [[ 11,12 ], 1, Add, [ 1 ] ],   # 29-P3/8 fusion backbone P3
  - [[ 18,19 ], 1, Add, [ 1 ] ],   # 30-P4/16 fusion backbone P4
  - [[ 27,28 ], 1, Add, [ 1 ] ],   # 31-P5/32 fusion backbone P5


# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 32
  - [[-1, 30], 1, Concat, [1]]  # 33 cat backbone P4
  - [-1, 3, C2f, [512]]  # 34

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 35
  - [[-1, 29], 1, Concat, [1]]  # 36 cat backbone P3
  - [-1, 3, C2f, [256]]  # 37 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]  # 38
  - [[-1, 34], 1, Concat, [1]]  # 39 cat head P4
  - [-1, 3, C2f, [512]]  # 40 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]  # 41
  - [[-1, 31], 1, Concat, [1]]  #TODO 42 cat head P5
  - [-1, 3, C2f, [1024]]  # 43 (P5/32-large)

  - [[37, 40, 43], 1, Detect, [nc]]  # 44 Detect(P3, P4, P5)
